jws/src/test/resources/org/springframework/ws/axis1/case1/contractfirst/soap_11/sendXsiTypes/rpcEncoded11-req1.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<soapenv:Body>
		<ns1:oneParam soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:ns1="http://codefirst.case1.axis1.ws.springframework.org">
			<param1 xsi:type="xsd:string">param</param1>
		</ns1:oneParam>
	</soapenv:Body>
</soapenv:Envelope>
